source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/VitoriaES.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="2.01">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/RecepcionarLoteRps</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/RecepcionarLoteRps</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>LoteRps</TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRps xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></RecepcionarLoteRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>RecepcionarLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</RecepcionarLoteRps>
		<ConsultarLoteRps versao="2.01">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/ConsultarLoteRps</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/ConsultarLoteRps</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarLoteRps xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></ConsultarLoteRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarLoteRps>
		<ConsultarNfsePorRps versao="2.01">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfsePorRps</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfsePorRps</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfsePorRps xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></ConsultarNfsePorRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarNfsePorRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfsePorRps>
		<CancelarNfse versao="2.01">
			<Descricao>Cancelar NFSe</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/CancelarNfse</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/CancelarNfse</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura>Pedido</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNfse xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></CancelarNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>CancelarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</CancelarNfse>
		<ConsultarNfseFaixa versao="2.01">
			<Descricao>Consultar NFSe Faixa</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfseFaixa</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfseFaixa</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseFaixa xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></ConsultarNfseFaixa></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarNfseFaixaResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseFaixa>
		<ConsultarNfseServicoPrestado versao="2.01">
			<Descricao>Consultar NFSe Servico Prestado</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfseServicoPrestado</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfseServicoPrestado</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseServicoPrestado xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></ConsultarNfseServicoPrestado></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarNfseServicoPrestadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseServicoPrestado>
		<ConsultarNfseServicoTomado versao="2.01">
			<Descricao>Consultar NFSe Servico Tomado</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfseServicoTomado</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/ConsultarNfseServicoTomado</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseServicoTomado xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></ConsultarNfseServicoTomado></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarNfseServicoTomadoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseServicoTomado>
		<GerarNfse versao="2.01">
			<Descricao>Gerar NFSe</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/GerarNfse</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/GerarNfse</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GerarNfse xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></GerarNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>GerarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</GerarNfse>
		<RecepcionarLoteRpsSincrono versao="2.01">
			<Descricao>Recepcionar LoteRPS Sincrono</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/RecepcionarLoteRpsSincrono</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/RecepcionarLoteRpsSincrono</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRpsSincrono xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></RecepcionarLoteRpsSincrono></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>RecepcionarLoteRpsSincronoResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</RecepcionarLoteRpsSincrono>
		<SubstituirNfse versao="2.01">
			<Descricao>Substituir NFSe</Descricao>
			<WebEnderecoHomologacao>https://wsnfse.vitoria.es.gov.br/homologacao/NotaFiscalService.asmx?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://wsnfse.vitoria.es.gov.br/producao/NotaFiscalService.asmx?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://www.abrasf.org.br/nfse.xsd/SubstituirNfse</WebActionHomologacao>
			<WebActionProducao>http://www.abrasf.org.br/nfse.xsd/SubstituirNfse</WebActionProducao>
			<SchemaArquivo>nfse v2 01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<TagExtraAssinatura>Pedido</TagExtraAssinatura>
			<TagExtraAtributoID>InfPedidoCancelamento</TagExtraAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SubstituirNfse xmlns="http://www.abrasf.org.br/nfse.xsd"><mensagemXML>{xmlBodyScape}</mensagemXML></SubstituirNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>SubstituirNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</SubstituirNfse>
	</Servicos>
</Configuracoes>
